"""

2. Реализовать проект расчета суммарного расхода ткани на производство одежды. Основная сущность (класс)
этого проекта — одежда, которая может иметь определенное название. К типам одежды в этом
проекте относятся пальто и костюм. У этих типов одежды существуют параметры: размер (для пальто) и рост (для костюма).
Это могут быть обычные числа: V и H, соответственно.
Для определения расхода ткани по каждому типу одежды использовать формулы: для пальто (V/6.5 + 0.5),
для костюма (2 * H + 0.3). Проверить работу этих методов на реальных данных.
Реализовать общий подсчет расхода ткани. Проверить на практике полученные на этом уроке знания: реализовать абстрактные
классы для основных классов проекта, проверить на практике работу декоратора @property.

"""

from abc import abstractmethod


class Clothes:

    @abstractmethod
    def __init__(self):
        pass

    @abstractmethod
    def consumption(self):
        pass


class Coat(Clothes):
    def __init__(self, _v=0):
        super().__init__()
        self.V = _v

    @property
    def consumption(self):
        return self.V / 6.5 + 0.5


class Suite(Clothes):
    def __init__(self, _h=0):
        super().__init__()
        self.H = _h

    @property
    def consumption(self):
        return 2 * self.H + 0.3


a = Coat(10)
b = Suite(15)
print(f'Общий расход : {round(a.consumption + b.consumption,2)} чегото там..')
